In [49]:
import pandas as pd

# 忽略警告
import warnings
warnings.filterwarnings("ignore")



# 创建一个DataFrame
<div style='background-color:#1abc9c'>
    <br>
    </div>

In [51]:
df1 = pd.DataFrame({'ID': [1, 2, 3],
                    'Name': ['Xiao', 'Mashy', 'Harry']})

- 将DataFrame 的索引变成 ID

In [25]:
df1 = df1.set_index('ID')

- 把DataFrame到出为Excel文件

In [26]:
df1.to_excel('datas\output.xlsx')

<div style='background-color:#3498db'>
    <br>
    </div>
    
# 数据读取 1     
使用文件`people.xlsx`

- **pandas 读取数据的时候默认是从不是空白的第0行开始**  
使用参数`header = `来修改从哪开始读取

In [27]:
# 读取数据
people = pd.read_excel('datas\people.xlsx', header=0)

### 显示DataFrame的shape 和 columns

In [28]:
print(people.shape)
print(people.columns)

(19972, 6)
Index(['ID', 'Type', 'Title', 'FirstName', 'MiddleName', 'LastName'], dtype='object')

In [29]:
# 把index 设置成`D
people.set_index('ID', inplace=True)
# 显示dataframe 的前5行（默认前5rows，可以更改参数）
display(people.head(3))

        Type Title FirstName MiddleName    LastName
ID
1   Employee   NaN       Ken          J     Sánchez
2   Employee   NaN     Terri        Lee       Duffy
3   Employee   NaN   Roberto        NaN  Tamburello

### 读取没有header的文件
当读取的Excel没有header的时候需要将参数设置为`header = None`  
pandas 会**自动生成**从`0`开始的整数作为header  
使用下列方法来手动设置header
```py
df.columns = ['ID','Type',...]
```

<div style='background-color:#81ecec'>
    <br>
    </div>
    
# Rows & Columns 的操作 1

In [30]:
# 字典
d = {'x': 100, 'y': 200, 'z': 300}

# 把字典转换成一个Series对象
s1 = pd.Series(d)
# print
print(s1)

x    100
y    200
z    300
dtype: int64

In [31]:
# Index
print(s1.index)

Index(['x', 'y', 'z'], dtype='object')

In [32]:
# Values
print(s1.values)

[100 200 300]

-----------
## 方法2

In [33]:
# 生成两个list
L1 = [100, 200, 300]
L2 = ['x', 'y', 'z']

In [34]:
s1 = pd.Series(L1, index=L2)
# 也可以直接
s1 = pd.Series([100, 200, 300], index=['x', 'y', 'z'])

<div style='background-color:#fab1a0'>
    <br>
    </div>
    
# 将Series合并成DataFrame

In [35]:
# 生成三个Series
s1 = pd.Series([1, 2, 3], index=['1st', '2nd', '3rd'], name='A')
s2 = pd.Series([10, 20, 30], index=['1st', '2nd', '3rd'], name='B')
s3 = pd.Series([100, 200, 300], index=['1st', '2nd', '3rd'], name='C')

In [91]:
# 以字典的形式合并成DataFrame
df_d = pd.DataFrame({
    s1.name: s1,
    s2.name: s2,
    s3.name: s3
})

# print
df_d

     A   B    C
1st  1  10  100
2nd  2  20  200
3rd  3  30  300

In [37]:
# 以List的形式合并成DataFrame
df_l = pd.DataFrame([
    s1,
    s2,
    s3
])

# print
df_l

   1st  2nd  3rd
A    1    2    3
B   10   20   30
C  100  200  300

<div style='background-color:#ffeaa7'>
    <br>
    </div>

# Pandas的自动填充    
使用文件`Books.xlsx`

In [38]:
books = pd.read_excel('datas\Books.xlsx',)

In [39]:
books

    Unnamed: 0  Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4 Unnamed: 5
0          NaN         NaN        NaN        NaN        NaN        NaN
1          NaN         NaN        NaN        NaN        NaN        NaN
2          NaN         NaN         ID       Name    InStore       Date
3          NaN         NaN        NaN   Book_001        NaN        NaN
4          NaN         NaN        NaN   Book_002        NaN        NaN
5          NaN         NaN        NaN   Book_003        NaN        NaN
6          NaN         NaN        NaN   Book_004        NaN        NaN
7          NaN         NaN        NaN   Book_005        NaN        NaN
8          NaN         NaN        NaN   Book_006        NaN        NaN
9          NaN         NaN        NaN   Book_007        NaN        NaN
10         NaN         NaN        NaN   Book_008        NaN        NaN
11         NaN         NaN        NaN   Book_009        NaN        NaN
12         NaN         NaN        NaN   Book_010        NaN        NaN
13         NaN         NaN        NaN   Book_011        NaN        NaN
14         NaN         NaN        NaN   Book_012        NaN        NaN
15         NaN         NaN        NaN   Book_013        NaN        NaN
16         NaN         NaN        NaN   Book_014        NaN        NaN
17         NaN         NaN        NaN   Book_015        NaN        NaN
18         NaN         NaN        NaN   Book_016        NaN        NaN
19         NaN         NaN        NaN   Book_017        NaN        NaN
20         NaN         NaN        NaN   Book_018        NaN        NaN
21         NaN         NaN        NaN   Book_019        NaN        NaN
22         NaN         NaN        NaN   Book_020        NaN        NaN

### 由上面的结果可以发现pandas并不能跳过空值, 这时候就需要在读取的时候调用两个参数
```py
pd.read_excel('datas\Books.xlsx', skiprows = 3 , usecols = 'C : F')
```

In [40]:
books = pd.read_excel('datas\Books.xlsx', skiprows=3, usecols='C:F', dtype={
                      'ID': str, 'InStore': str, 'Date': str})
type(books.ID)

pandas.core.series.Series

- 已知可以通过这种方式来进行修改某个cell的值
```py
books.ID[0] = 100
```

则，我们可以通过以index来进行**循环**的操作

In [41]:
from datetime import date, timedelta
# 设置初始日期
start = date(2018, 1, 1)


for i in books.index:
    books.at[i, 'ID'] = i + 1  # DataFrame.at[row,column]
    books['InStore'][i] = 'Yes' if i % 2 == 0 else 'No'
    books['Date'][i] = start + timedelta(i)


books.set_index('ID', inplace=True)
# print
books

        Name InStore        Date
ID
1   Book_001     Yes  2018-01-01
2   Book_002      No  2018-01-02
3   Book_003     Yes  2018-01-03
4   Book_004      No  2018-01-04
5   Book_005     Yes  2018-01-05
6   Book_006      No  2018-01-06
7   Book_007     Yes  2018-01-07
8   Book_008      No  2018-01-08
9   Book_009     Yes  2018-01-09
10  Book_010      No  2018-01-10
11  Book_011     Yes  2018-01-11
12  Book_012      No  2018-01-12
13  Book_013     Yes  2018-01-13
14  Book_014      No  2018-01-14
15  Book_015     Yes  2018-01-15
16  Book_016      No  2018-01-16
17  Book_017     Yes  2018-01-17
18  Book_018      No  2018-01-18
19  Book_019     Yes  2018-01-19
20  Book_020      No  2018-01-20

<div style='background-color:#ff7675'>
    <br>
    </div>
    
# Pandas的函数填充    
使用文件`Books_price.xlsx`

In [42]:
books = pd.read_excel('datas/Books_price.xlsx')
books.head()

   ID      Name  ListPrice  Discount  Price
0   1  Book_001         10       0.5    NaN
1   2  Book_002         20       0.5    NaN
2   3  Book_003         30       0.5    NaN
3   4  Book_004         40       0.5    NaN
4   5  Book_005         50       0.5    NaN

In [43]:
books['Price'] = books['ListPrice'] * books['Discount']
books.head()

   ID      Name  ListPrice  Discount  Price
0   1  Book_001         10       0.5    5.0
1   2  Book_002         20       0.5   10.0
2   3  Book_003         30       0.5   15.0
3   4  Book_004         40       0.5   20.0
4   5  Book_005         50       0.5   25.0

In [73]:
#乘以手动输入的值
books['New Price'] = books['ListPrice'] * 0.8
#print
books.head()

   ID      Name  ListPrice  Discount  Price  New Price
0   1  Book_001         10       0.5    5.0        8.0
1   2  Book_002         20       0.5   10.0       16.0
2   3  Book_003         30       0.5   15.0       24.0
3   4  Book_004         40       0.5   20.0       32.0
4   5  Book_005         50       0.5   25.0       40.0

In [101]:
#使用迭代的方法实现相同效果 (cell对cell操作)
books = pd.read_excel('datas/Books_price.xlsx')

#书涨价 5元
books['ListPrice'] = books['ListPrice'] + 5

for i in range(5,16):
    books.Price[i] = books.ListPrice[i] * books.Discount[i]

#print    
books

    ID      Name  ListPrice  Discount  Price
0    1  Book_001         15       0.5    NaN
1    2  Book_002         25       0.5    NaN
2    3  Book_003         35       0.5    NaN
3    4  Book_004         45       0.5    NaN
4    5  Book_005         55       0.5    NaN
5    6  Book_006         65       0.5   32.5
6    7  Book_007         75       0.5   37.5
7    8  Book_008         85       0.5   42.5
8    9  Book_009         95       0.5   47.5
9   10  Book_010        105       0.5   52.5
10  11  Book_011        115       0.5   57.5
11  12  Book_012        125       0.5   62.5
12  13  Book_013        135       0.5   67.5
13  14  Book_014        145       0.5   72.5
14  15  Book_015        155       0.5   77.5
15  16  Book_016        165       0.5   82.5
16  17  Book_017        175       0.5    NaN
17  18  Book_018        185       0.5    NaN
18  19  Book_019        195       0.5    NaN
19  20  Book_020        205       0.5    NaN



#### 也可以使用这种方法才更改值


```py
pd.Series.apply(func)
```

In [107]:

books = pd.read_excel('datas/Books_price.xlsx')
books['ListPrice'] = books['ListPrice'].apply(lambda x: x+2)
books.head()

   ID      Name  ListPrice  Discount  Price
0   1  Book_001         12       0.5    NaN
1   2  Book_002         22       0.5    NaN
2   3  Book_003         32       0.5    NaN
3   4  Book_004         42       0.5    NaN
4   5  Book_005         52       0.5    NaN